Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::PipeElbowPreferenceTable Class Referencefinal
MEP Element Manager
The PipeElbowPreferenceTable contains cross section related information for Pipe elbows. More...
#include <MEPPipeElbowPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::PipeElbowPreferenceTable:
 Classes
struct  | Key
The key that uniquely identifies a row in the PipeElbowPreferenceTable. More...
class  | Modifier
Modifier of the PipeElbowPreferenceTable. More...
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetReferenceId (uint32_t index) const
Result< double >  | GetAngle (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Result< bool >  | IsRowValidByKey (const Key &key) const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Result< double >  | GetDiameter (uint32_t index) const
Result< double >  | GetDiameterByKey (const Key &key) const
Result< double >  | GetRadius (uint32_t index) const
Result< double >  | GetRadiusByKey (const Key &key) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByKey (const Key &key) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< PipeElbowPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a PipeElbowPreferenceTable.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PipeElbowPreferenceTable contains cross section related information for Pipe elbows.
Since
Archicad 28
The table uses the keys defined by the PipeReferenceSet and PipeAngleSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Getters
 for (const UniqueID& pipeElbowTableId : pipeElbowTableIds) {
 ACAPI::Result<PipeElbowPreferenceTable> pipeElbowTable = PipeElbowPreferenceTable::Get (pipeElbowTableId);
 if (pipeElbowTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", pipeElbowTable->GetName ());
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < pipeElbowTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("ReferenceId", *pipeElbowTable->GetReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Angle", *pipeElbowTable->GetAngle (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Diameter", *pipeElbowTable->GetDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Radius", *pipeElbowTable->GetRadius (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *pipeElbowTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*pipeElbowTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 Modification
 ACAPI::Result<PipeElbowPreferenceTable> newTable = PipeElbowPreferenceTable::Get (*newTableId);
 if (newTable.IsErr ())
 return newTable.UnwrapErr ().kind;
 ACAPI::Result<PipeReferenceSet> referenceSet = GetPipeReferenceSet ();
 if (referenceSet.IsErr ())
 return referenceSet.UnwrapErr ().kind;
 newTable->Modify ([&] (PipeElbowPreferenceTable::Modifier& modifier) -> GSErrCode {
 for (uint32_t i = 0; i < referenceSet->GetSize (); ++i) {
 ACAPI::Result<uint32_t> referenceId = referenceSet->GetReferenceId (i);
 double value = static_cast<double> (*referenceId) / 1000.0;
 modifier.SetDiameterByKey ({ *referenceId, 90.0 }, value);
 modifier.SetRadiusByKey ({ *referenceId, 90.0 }, value);
 }
 return NoError;
 }, "Fill the new table with values");
 preferenceReporter.Add ("Empty the first row of the new pipe elbow table.");
 newTable->Modify ([&] (PipeElbowPreferenceTable::Modifier& modifier) {
 ACAPI::Result<void> emptyRowResult = modifier.DeleteRow (0);
 if (emptyRowResult.IsOk ())
 preferenceReporter.Add ("Empty row was successful.");
 else
 preferenceReporter.Add ("Empty row unsuccessful", GS::UniString (emptyRowResult.UnwrapErr ().text));
 }, "Empty Row from preference table.");
 preferenceReporter.Add ("Set diameter for row identified by ReferenceId.");
 newTable->Modify ([&] (PipeElbowPreferenceTable::Modifier& modifier) {
 ACAPI::Result<uint32_t> referenceId = newTable->GetReferenceId (1);
 ACAPI::Result<double> currentDiameter = newTable->GetDiameter (1);
 modifier.SetDiameterByKey ({ *referenceId, 90.0 }, *currentDiameter * 2.0);
 }, "Set diameter for row identified by ReferenceId.");
 preferenceReporter.Write ();
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::PipeElbowPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< PipeElbowPreferenceTable > ACAPI::MEP::PipeElbowPreferenceTable::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a PipeElbowPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested PipeElbowPreferenceTable.
Returns
If the uniqueId belongs to a PipeElbowPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetAngle()
 Result< double > ACAPI::MEP::PipeElbowPreferenceTable::GetAngle  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the angle of the table's row.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::PipeElbowPreferenceTable::GetDescription  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByKey()
 Result< GS::UniString > ACAPI::MEP::PipeElbowPreferenceTable::GetDescriptionByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeElbowPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the description of the table's row.
◆ GetDiameter()
 Result< double > ACAPI::MEP::PipeElbowPreferenceTable::GetDiameter  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetDiameterByKey()
 Result< double > ACAPI::MEP::PipeElbowPreferenceTable::GetDiameterByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeElbowPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetName()
 GS::UniString ACAPI::MEP::PipeElbowPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetRadius()
 Result< double > ACAPI::MEP::PipeElbowPreferenceTable::GetRadius  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the radius value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetRadiusByKey()
 Result< double > ACAPI::MEP::PipeElbowPreferenceTable::GetRadiusByKey  |  ( |  const Key & |  key | ) |   const
Parameters
key | The key that uniquely identifies a row in the PipeElbowPreferenceTable.
Returns
Returns error if a row for a given key does not occur in the table, otherwise returns the radius value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetReferenceId()
 Result< uint32_t > ACAPI::MEP::PipeElbowPreferenceTable::GetReferenceId  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the referenceId of the table's row.
◆ GetSize()
 uint32_t ACAPI::MEP::PipeElbowPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of table.
◆ IsEditable()
 Result< void > ACAPI::MEP::PipeElbowPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::PipeElbowPreferenceTable::IsRowValid  |  ( |  uint32_t |  index | ) |   const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByKey()
 Result< bool > ACAPI::MEP::PipeElbowPreferenceTable::IsRowValidByKey  |  ( |  const Key & |  key | ) |   const
A row is considered valid if its diameter and radius contains non-zero values, description is optional.
Parameters
key | The key that uniquely identifies a row in the PipeElbowPreferenceTable.
Returns
Returns error if the referenceId and angle is not in the PipeReferenceSet and PipeAngleSet, otherwise returns the validity state of the row.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::PipeElbowPreferenceTable::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.